
```fish
plan -chdir=sample/bucket
```

<details><summary>Outline of changes.</summary>

```diff
+ module.sample_bucket.aws_s3_bucket.sample will be created
+ module.sample_bucket.aws_s3_bucket_versioning.sample will be created
```
</details>

<details><summary>Plan: 2 to add, 0 to change, 0 to destroy.</br>

###### TF Sample by @RDhar via [pull_request](https://github.com/DevSecTop/TF-via-PR/actions/runs/10103643955/job/27941369601) at 2024-07-26T00:37:16Z.
</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.sample_bucket.aws_s3_bucket.sample will be created
  + resource "aws_s3_bucket" "sample" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "sample"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "sample-bucket"
        }
      + tags_all                    = {
          + "Name"      = "sample-bucket"
          + "Stack"     = "bucket"
          + "Terraform" = "dev"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.sample_bucket.aws_s3_bucket_versioning.sample will be created
  + resource "aws_s3_bucket_versioning" "sample" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + sample_bucket_id = (known after apply)

```
</details>
<!-- 257--chdir-sample-bucket--backend-config-backend-dev-tfbackend-dev-terraform--out-tfplan -->